distribution/scripts/jmeter/requests/100Elements_buyStocks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body><m:buyStocks xmlns:m="http://services.samples/xsd">
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>100</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>99</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>98</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>97</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>96</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>95</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>94</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>93</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>92</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>91</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>90</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>89</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>88</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>87</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>86</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>85</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>84</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>83</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>82</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>81</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>80</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>79</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>78</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>77</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>76</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>75</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>74</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>73</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>72</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>71</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>70</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>69</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>68</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>67</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>66</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>65</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>64</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>63</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>62</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>61</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>60</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>59</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>58</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>57</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>56</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>55</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>54</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>53</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>52</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>51</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>50</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>49</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>48</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>47</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>46</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>45</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>44</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>43</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>42</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>41</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>40</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>39</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>38</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>37</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>36</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>35</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>34</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>33</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>32</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>31</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>30</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>29</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>28</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>27</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>26</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>25</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>24</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>23</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>22</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>21</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>20</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>19</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>18</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>17</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>16</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>15</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>14</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>13</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>12</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>11</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>10</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>9</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>8</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>7</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>6</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>5</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>4</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>3</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>2</volume></order>
<order><symbol>IBM</symbol><buyerID>john</buyerID><price>140.34</price><volume>1</volume></order>
</m:buyStocks></soapenv:Body></soapenv:Envelope>
